{"pageProps":{"content":{"id":"reseaux-composants-cartereseau","path":"reseaux/composants/cartereseau.md","content":"<h1>Carte réseau</h1>\n<p>Sources: <a href=\"https://www.gralon.net/articles/internet-et-webmaster/adsl/article-la-carte-reseau---presentation-et-fonctionnement-1429.htm\">https://www.gralon.net/articles/internet-et-webmaster/adsl/article-la-carte-reseau---presentation-et-fonctionnement-1429.htm</a></p>\n<h3>Rôle</h3>\n<p>La carte réseau sert d’<strong>interface physique entre l’ordinateur et le câble du réseau</strong>.</p>\n<p>Elle a pour fonction de préparer, d’envoyer et de contrôler le flux de données sur le réseau.</p>\n<p>Elle sert aussi à traduire les données venant du câble en octets afin que l’Unité Centrale de l’ordinateur les comprenne. Par ailleurs, chaque carte dispose d’une adresse unique, appelée <strong>adresse MAC</strong>, qui permet de l’identifier parmi toutes les autres cartes réseau.</p>\n<p>Cette adresse lui est attribuée par son fabricant et est inscrite sur la puce de la carte.</p>\n<p>Lorsqu’elle fonctionne, la carte <strong>indique son adresse au reste du réseau</strong> pour pouvoir être identifiée.</p>\n<h3>Adresse MAC</h3>\n<p>Une <strong>adresse MAC,</strong> parfois nommée <strong>adresse physique</strong>, est un identifiant physique stocké dans une <a href=\"https://fr.wikipedia.org/wiki/Carte_r%C3%A9seau\"></a>carte réseau ou une interface réseau similaire. À moins qu'elle n'ait été modifiée par l'utilisateur, elle est unique au monde. Toutes les cartes réseau ont une adresse MAC.</p>\n<p>MAC constitue la partie inférieure de la couche liaison (couche 2 du modèle OSI). Elle insère et traite ces adresses au sein des trames transmises. Elle est parfois appelée <em>adresse ethernet</em>, UAA (Universally Administered Address), BIA (Burned-In Address), MAC-48 ou EUI-48.</p>\n<h3>Différents types de cartes réseau</h3>\n<ul>\n<li>filaire interne:\n<ul>\n<li>carte PCI, PCI Express à insérer dans un connecteur PCI libre sur la carte mère</li>\n<li>interface réseau intégré à la carte mère, avec un connecteur RJ45 fixé sur la carte mère</li>\n</ul>\n</li>\n<li>filaire externe: boitier externe avec un connectique prévu pour un câble ethernet à brancher à l’ordinateur, souvent via USB.</li>\n<li>sans fil:\n<ul>\n<li>carte wifi interne: carte PCI équipée d’une antenne</li>\n</ul>\n</li>\n</ul>\n<hr>\n<p>Les ordinateurs portables ne disposant pas de connecteur PCI ou PCIe, d'autres solutions existent :</p>\n<ul>\n<li>Carte réseau au standard <em>PC Card</em> (appelé aussi PCMCIA) ;</li>\n<li>Interface réseau (WIFI ou ethernet) déjà intégrée au portable ;</li>\n<li>Carte réseau connectée en USB</li>\n</ul>\n<h3>Bus</h3>\n<p>Une carte réseau se connecte à la carte mère de l’ordinateur via un <strong>bus informatique</strong>, généralement standardisé.</p>\n<h3>Débit</h3>\n<p>Deux équipements réseau doivent communiquer dans le même débit.</p>\n<p>Le débit exprimé en <strong>Mbit/s</strong> (Mégabits par seconde) désigne la capacité d'un équipement réseau à émettre et recevoir plus ou moins d'informations par seconde.</p>\n<p>Avec le standard Ethernet, les débits actuels sont :</p>\n<ul>\n<li>10 Mbit/s</li>\n<li>100 Mbit/s (Fast Ethernet)</li>\n<li>1000 Mbit/s (Gigabit Ethernet).</li>\n</ul>\n<p>On distingue deux types de carte réseau :</p>\n<ul>\n<li>celles qui communiquent en <strong>half duplex</strong> ne peuvent qu'émettre ou recevoir des informations à un instant donné</li>\n<li>celles qui fonctionnent en mode <strong>full duplex</strong> peuvent émettre et recevoir simultanément.</li>\n</ul>\n<p><strong>Différence entre le débit et la bande passante:</strong></p>\n<p>La ****bande passante correspond au débit maximal d’un réseau, alors que le débit est utilisé pour évaluer la qualité de la connexion à un moment donné</p>\n<h3>Mode de communication</h3>\n<p>La carte réseau effectue des vérifications avant d’envoyer ses données:</p>\n<ul>\n<li>nombre de paquets à envoyer et taille maximale autorisée par la carte réceptrice.</li>\n<li>intervalle à laisser entre les transmissions de données</li>\n<li>volume de données</li>\n<li>l’indication du délai à prévoir avant l’envoi de la confirmation</li>\n<li>vitesse de transmission autorisée</li>\n</ul>\n<p>Il y a donc un vrai dialogue entre 2 cartes réseaux (émettrice et réceptrice) avant l’envoi et la réception de données.</p>\n<h3>Fabricants</h3>\n<p>TP-LINK, D-LINK, Asus, TRENDnet, Gigabyte Technology</p>\n<h3>Réseau d’ondes électromagnétiques</h3>\n","title":"Carte réseau"}},"__N_SSG":true}