{"pageProps":{"content":{"id":"backend-postgresql","path":"backend/postgresql.md","content":"<h1>Postgres</h1>\n<h2>View</h2>\n<p>Une view c'est une synthèse d'une requête d'interrogation de la base. On peut la voir comme une table virtuelle qui représente le résultat d'une requête sur la base.</p>\n<p>Les avantages des vues sont :</p>\n<ul>\n<li>d'éviter de taper une requête très longue : la view sert à donner un nom à la requête pour l'utiliser souvent,</li>\n<li>de masquer certaines données à certains utilisateurs. En SQL, les protections d'une vue ne sont pas forcément les mêmes que celles des tables sous-jacentes.</li>\n</ul>\n<h3>Exemple</h3>\n<pre><code>  CREATE TABLE Employes (id SERIAL, nom TEXT, departement INTEGER);\n  CREATE TABLE Departements (id SERIAL, nom TEXT);\n  SELECT e.nom as Employe, d.nom as Departement \n            FROM Employes e,Departements d WHERE e.departement = d.id;\n</code></pre>\n<p>Avec une view:</p>\n<pre><code>  CREATE VIEW ToutLeMonde AS \n         SELECT e.nom as Employe, d.nom as Departement \n                FROM Employes e,Departements d \n                WHERE e.departement = d.id;\n</code></pre>\n<p>On peut alors écrire:</p>\n<pre><code>SELECT * FROM ToutLeMonde ;\n</code></pre>\n<p>Les vues ne sont pas forcément purement virtuelles. Certains SGBD comme Oracle Database1 permettent de stocker la vue sur disque, elle devient alors un véritable système de cache.</p>\n<h2>Materialized views</h2>\n<p>Une materialized view c'est une view, et <strong>stockée</strong> pour une utilisation ultérieure.\nÉtant donné que les données sont pré-calculées, l’interrogation d’une vue matérialisée est plus rapide que l’exécution d’une requête sur la table de base de la vue.\nCette différence de performances peut être significative lorsqu’une requête est exécutée fréquemment ou est suffisamment complexe. Par conséquent, les vues matérialisées peuvent accélérer les opérations d’agrégation, de projection et de sélection coûteuses, en particulier celles qui s’exécutent fréquemment et qui s’exécutent sur de grands ensembles de données.</p>\n<p>On l’utilise essentiellement à des fins d'optimisation et de performance dans le cas où la requête associée est particulièrement complexe ou lourde, ou pour faire des réplications de table.</p>\n<p><a href=\"https://docs.snowflake.com/fr/user-guide/views-materialized.html\">Plus d'infos</a></p>\n","title":"Postgres"}},"__N_SSG":true}