{"pageProps":{"content":{"id":"ops-protocoles-ssh","path":"ops/protocoles/ssh.md","content":"<h1>SSH (Secure Shell)</h1>\n<p>Protocole d’administration à distance qui permet aux utilisateurs de contrôler et de modifier leurs serveurs distants via Internet. Le service a été créé pour remplacer de façon sécurisée le Telnet, non chiffré.</p>\n<p>SSH utilise des <strong>techniques cryptographiques</strong> pour garantir que toutes les <strong>communications</strong> vers et depuis le serveur distant soient <strong>chiffrées</strong>. Il fournit un mécanisme pour authentifier un utilisateur distant, transférer les entrées du client vers l’hôte et relayer la sortie vers le client.</p>\n<p>La <strong>commande SSH</strong> se compose de 3 parties distinctes : <strong>SSH {utilisateur} @ {hôte}</strong>.</p>\n<ul>\n<li>La <strong>commande de clé SSH</strong> indique à votre système que vous souhaitez ouvrir une connexion Secure Shell cryptée.</li>\n<li><strong>{utilisateur}</strong> représente le compte auquel vous souhaitez accéder. L’utilisateur root par exemple est l’équivalent de l’administrateur système avec des droits absolus sur toute modification au niveau du système.</li>\n<li><strong>{hôte}</strong> fait référence à l’ordinateur auquel vous souhaitez accéder. Cela peut être une adresse IP (par exemple 244.235.23.19) ou un nom de domaine (par exemple www.xyzdomain.com).</li>\n</ul>\n<h2>Connexion</h2>\n<h3>Syntaxe de base</h3>\n<p>Pour se connecter à un système distant utilisant SSH, on peut utiliser la commande ssh.<br>\nLa forme la plus élémentaire de la commande est:</p>\n<pre><code>ssh remote_host (remote_host = adresse IP ou le nom de domaine auquel vous essayez de vous connecter)\n</code></pre>\n<p>Cette commande suppose que le nom d’utilisateur sur le système distant est le même que le nom d’utilisateur sur son système local.\nSi le nom d'utilisateur est différent sur le système distant, on peut le spécifier comme ceci:</p>\n<pre><code>ssh remote_username@remote_host\n</code></pre>\n<p>Une fois qu'on est connecté au serveur, il peut être demandé de vérifier son identité en fournissant un mot de passe.\nOn peut également générer des clés à utiliser à la place des mots de passe.</p>\n<p>Pour quitter une session ssh:</p>\n<pre><code>exit\n</code></pre>\n<h3>Authentification par clé</h3>\n<p>Fonctionne en créant une paire de clés : une clé privée et une clé publique.</p>\n<p>La clé privée se trouve sur la machine du client et est sécurisée et gardée secrète.\nLa clé publique peut être donnée à n’importe qui ou placée sur n’importe quel serveur auquel vous souhaitez accéder.</p>\n<p>Lorsque vous tentez de vous connecter à l’aide d’une paire de clés, le serveur utilise la clé publique pour créer un message pour l’ordinateur client qui ne peut être lu qu’avec la clé privée.\nL’ordinateur client renvoie alors la réponse appropriée au serveur et celui-ci saura que le client est légitime.</p>\n<p>Pour générer une paire de clés SSH:</p>\n<pre><code>ssh-keygen -t rsa\n</code></pre>\n<p>Elles sont localisées ici <code>~/.ssh/id_rsa.pub et ~/.ssh/id_rsa</code></p>\n<p>Pour transférer la clé publique vers le serveur: (dans le cas où on a un mot de passe côté serveur)</p>\n<pre><code>ssh-copy-id remote_host\n</code></pre>\n<p>Si vous avez créé des clés SSH, vous pouvez renforcer la sécurité de votre serveur en désactivant l’authentification uniquement par mot de passe. En dehors de la console, la seule façon de se connecter à votre serveur est d’utiliser la clé privée qui se couple avec la clé publique que vous avez installée sur le serveur.\nAvertissement : Avant de procéder à cette étape, assurez-vous que vous avez installé une clé publique pour votre serveur. Sinon, vous serez bloqué à l’extérieur !</p>\n<h2>Fonctionnement</h2>\n<p>SSH fonctionne en connectant un programme client à un serveur ssh, appelé sshd.</p>\n<p>Sur votre serveur, le sshd devrait déjà fonctionner. Si ce n’est pas le cas, vous devrez peut-être accéder à votre serveur via une console Web ou une console série locale.\nSur Ubuntu, vous pouvez démarrer le serveur ssh en tapant:</p>\n<pre><code>sudo systemctl start ssh\n</code></pre>\n<h2>Configuration</h2>\n<p>Lorsque vous modifiez la configuration de SSH, vous modifiez les paramètres du serveur sshd.</p>\n<p>Dans Ubuntu, le fichier de configuration principal de sshd se trouve à /etc/ssh/sshd_config.\nA l'intérieur on retrouve des déclarations de:</p>\n<ul>\n<li>port (22 par défaut)</li>\n<li>clés d'hôtes (HostKey</li>\n<li>niveau de connexion (SyslogFacility, LogLevel)</li>\n<li>LoginGraceTime (maintien en secondes de la connexion active sans se connecter avec succès)</li>\n<li>PermitRootLogin (autoriser ou non le user root à se connecter)</li>\n<li>strictModes (sécurité qui refusera les tentatives de connexion si les fichiers d'auth sont lisibles par tous)</li>\n</ul>\n<p>Pour appliquer les modifications de la config:</p>\n<pre><code>sudo systemctl reload ssh\n</code></pre>\n","title":"Protocole SSH"}},"__N_SSG":true}