{"pageProps":{"content":{"id":"ops-processus-supervisor","path":"ops/processus/supervisor.md","content":"<h1>Supervisor</h1>\n<p>(Notion de socket/pid)</p>\n<p>Supervisor est un petit outil codé en Python et permettant d'assurer le suivi et le contrôle de services/processus applicatifs sur des systèmes de type UNIX.\nOn peut le comparer à launchd (utilisé par OSX) ou runit. (mettre des liens)\nAttention toutefois il n'est pas destiné à remplacer le process init des systèmes UNIX. (process init c'est quoi ?)\nIl est par contre le parfait allié pour lancer et suivre des services applicatifs liés à un projet et qui doivent être démarrés et disponibles en permanence.</p>\n<p>Supervisor est disponible en paquet Debian en version 3.0, l'installation est donc très facile :\n<code>apt-get install supervisor</code></p>\n<p>Supervisor est divisé en deux composants différents:</p>\n<h3>Supervisord</h3>\n<p>Supervisord est la partie qui a la responsabilité de démarrer les services configurés et de les redémarrer en cas de crash. Il est configurable via le fichier /etc/supervisor/supervisord.conf</p>\n<h3>Supervisorctl</h3>\n<p>Supervisorctl est le client permettant d'administrer les services gérés par supervisor. Il est capable de se connecter à plusieurs démons supervisord et permet de démarrer / arrêter des services. Il est possible de les faire fonctionner soit via une socket soit via TCP. Il est également possible de gérer une authentification lors de la connexion au démon.</p>\n<h3>Exemples</h3>\n<h4>Ajouter un service à supervisor</h4>\n<p>Pour ajouter un service à supervisor il suffit de le déclarer en ajoutant un fichier dans /etc/supervisor/conf.d</p>\n<pre><code>[program:blogd]\ncommand=node node_modules/bin/blogd\n\ndirectory=/srv/my_project\n\nautostart=true\nautorestart=true\nstartretries=20\nnumprocs=1\nstdout_logfile=/var/log/blogd.log\nredirect_stderr=true\n</code></pre>\n<p>Il faut ensuite redémarrer le supervisor pour appliquer les changements.</p>\n<p>On peut également redémarrer un service, ou bien parcourir les logs.\nIl y a également une interface web disponible activable via la section [inet_http_server]</p>\n<h2>Capistrano</h2>\n<p>Capistrano est un outil qui permet d'automatiser des tâches serveur, mais surtout de déployer simplement des applications. Même si il est développé en Ruby il est tout à fait possible de l'utiliser pour déployer des applications qui n'utilisent pas ce langage.</p>\n<h2>PM2</h2>\n","title":"Supervisor"}},"__N_SSG":true}