{"pageProps":{"content":{"id":"frontend-javascript-npm","path":"frontend/javascript/npm.md","content":"<h1>NPM</h1>\n<p>npm (Node Package Manager) est une plateforme de gestion de <a href=\"\">paquets</a> pour javascript.</p>\n<h1>Utilisations</h1>\n<ul>\n<li>\n<p>Installation de paquets javascript:\nnpm permet d'installer facilement des paquets de code existants.</p>\n</li>\n<li>\n<p>Partage de paquets javascript:\nnpm permet de publier ses packages pour les partager avec d'autres utilisateurs, qui pourront les intégrer dans leurs projets.</p>\n</li>\n<li>\n<p>Gestion des dépendances de projet:\nnpm permet d'aider à gérer les dépendances de projet. Les dépendances sont les paquets dont un projet a besoin pour fonctionner correctement.\nnpm tient à jour une liste des dépendances de chaque projet et s'assure qu'elles sont toutes installées et à jour.</p>\n</li>\n<li>\n<p>Exécution de scripts:\nnpm permet d'exécuter des scripts.\nLes scripts npm peuvent être utilisés pour automatiser des tâches de développement courantes, comme la mise à jour des dépendances ou le démarrage d'un serveur de développement.</p>\n</li>\n</ul>\n<h1>Fonctionnement</h1>\n<p>npm fonctionne principalement à travers une interface de ligne de commande (CLI).</p>\n<p>Lors de l'installation de npm (généralement installé avec <a href=\"\">Node.js</a>, plateforme d'exécution JavaScript), on installe également la CLI appelée npm.</p>\n<p>Pour utiliser npm, on écrit <code>npm</code> suivi de la commande que l'on veut exécuter.</p>\n<p>Exemple pour installer un package: <code>$ npm install &#x3C;nom-du-paquet></code>.\nnpm se connecte alors à la base de données en ligne de npm, télécharge le paquet et l'installe sur l'ordinateur.</p>\n<p>Lorsqu'on utilise npm pour gérer les dépendances d'un projet, npm utilise un fichier spécial appelé <code>package.json</code> pour garder une trace des dépendances.</p>\n<p>Ce fichier liste tous les paquets dont le projet a besoin, ainsi que la version spécifique de chaque paquet. Ainsi, lorsqu'une personne décide d'installer le projet, npm peut se référer à ce fichier package.json, télécharger et installer automatiquement tous les paquets nécessaires au bon fonctionnement du projet.</p>\n<p><strong>En somme, npm est un outil qui simplifie le processus d'installation, de partage et de gestion des paquets de code javascript.</strong></p>\n<h1>Node_modules</h1>\n<p>npm crée un dossier <code>node_modules</code> dès lors qu'un paquet est installé sur un projet. Ce dossier stocke les packages installés (avec leurs dépendances).</p>\n<h1>Inconvénients</h1>\n<ul>\n<li>\n<p>Gestion des dépendances: un paquet peut avoir ses propres dépendances, qui peuvent à leur tour avoir leurs propres dépendances. Si 2 paquets dépendent de versions différentes du même paquet, on peut avoir des conflits.\nLa gestion de ces dépendances peut donc devenir complexe, notamment sur de gros projets.</p>\n</li>\n<li>\n<p>Qualité des paquets: un paquet dépend du/des développeurs derrière lui. Il faut faire attention à utiliser des paquets de qualité, et maintenus.\nOn peut avoir des problèmes si on utilise des paquets non maintenus:</p>\n<ul>\n<li>sécurité: ca si une vulnérabilité est découverte, elle ne sera pas corrigée.</li>\n<li>compatibilité: au fur et à mesure des montées de versions des langages, paquets, etc, le paquet non maintenu peut devenir non compatible. Il pourra être alors difficile de mettre à jour d'autres aspects du projet.</li>\n<li>bugs: si un bug/pb de performance est découvert sur le paquet, il ne sera pas corrigé.</li>\n<li>support: pas de support si problème ou question.</li>\n</ul>\n</li>\n<li>\n<p>Sécurité: un paquet dépend du/des développeurs derrière lui. Un paquet peut donc contenir du code malveillant (attaque système, vol infos, ...).</p>\n</li>\n<li>\n<p>Taille du node_modules: npm crée un dossier <code>node_modules</code> qui stocke les packages installés (avec leurs propres packages de dépendances, ...). Ce dossier peut donc vite devenir très volumineux surtout si ces packages ont eux aussi beaucoup de dépendances. Cela peut devenir problématique pour le stockage, la sauvegarde, ou le déploiement du projet.</p>\n</li>\n</ul>\n","title":"NPM"}},"__N_SSG":true}